### Тема “Вычисления с помощью Numpy”
### Задание_1.

In [3]:
import numpy as np

In [4]:
a = np.array([[1,6],
             [2,8],
             [3,11],
             [3,10],
             [1,7]])
print(a)
print("Формат массива а: {}". format(a.shape))
print("Количество символов в массиве а: {}". format(a.size))

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
Формат массива а: (5, 2)
Количество символов в массиве а: 10

In [5]:
mean_a = a.mean(axis=0)
print(f'Среднее значение признака: {mean_a}')

Среднее значение признака: [2.  8.4]

### Задание_2.

In [6]:
import numpy as np
a = np.array([[1,6],
             [2,8],
             [3,11],
             [3,10],
             [1,7]])
mean_a = a.mean(axis=0)
a_centered = a - mean_a
print(f'Разность значений массива а и средних значений признаков:')
a_centered

Разность значений массива а и средних значений признаков:

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### Задание_3.

In [7]:
print(f'первый признак:{a_centered[:, 0]}')
print(f'второй признак:{a_centered[:, 1]}')
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1]
print(f'Скалярное произведение столбцов массива a_centered:{a_centered_sp}')

первый признак:[-1.  0.  1.  1. -1.]
второй признак:[-2.4 -0.4  2.6  1.6 -1.4]
Скалярное произведение столбцов массива a_centered:8.0

In [8]:
N = a.shape[0]
print(f'количество наблюдений:{N}')
covariance = a_centered_sp / (N - 1)
print(f'несмещенная оценка ковариации.:{covariance}')
m = np.transpose(a)#аргумента m функция np.cov 
covariance_2 = np.cov(m)
print(f'несмещенная оценка ковариации, второй способ.:{covariance_2[0,1]}')

количество наблюдений:5
несмещенная оценка ковариации.:2.0
несмещенная оценка ковариации, второй способ.:2.0

### Тема “Работа с данными в Pandas”
### Задание_1

In [9]:
import pandas as pd

In [10]:
authors = pd.DataFrame({'author_id' : [1, 2, 3], 'author_name' : ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [11]:
 book = pd.DataFrame({'author_id' : [1, 1, 1, 2, 2, 3, 3], 'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза','Таланты и поклонники'], 'price' :[12,10,43,67,7,45,34] })
 book

   author_id            book_title  price
0          1           Отцы и дети     12
1          1                 Рудин     10
2          1     Дворянское гнездо     43
3          2      Толстый и тонкий     67
4          2       Дама с собачкой      7
5          3                 Гроза     45
6          3  Таланты и поклонники     34

### Задание_2

In [12]:
import pandas as pd
authors = pd.DataFrame({'author_id' : [1, 2, 3], 'author_name' : ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({'author_id' : [1, 1, 1, 2, 2, 3, 3], 'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза','Таланты и поклонники'], 'price' :[12,10,43,67,7,45,34] })
author_price = pd.merge(authors, book, on = "author_id", how = "inner" )
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети     12
1          1    Тургенев                 Рудин     10
2          1    Тургенев     Дворянское гнездо     43
3          2       Чехов      Толстый и тонкий     67
4          2       Чехов       Дама с собачкой      7
5          3  Островский                 Гроза     45
6          3  Островский  Таланты и поклонники     34

### Задание_3

In [13]:
top5 = author_price.sort_values(by = 'price', ascending = False)
top5

   author_id author_name            book_title  price
3          2       Чехов      Толстый и тонкий     67
5          3  Островский                 Гроза     45
2          1    Тургенев     Дворянское гнездо     43
6          3  Островский  Таланты и поклонники     34
0          1    Тургенев           Отцы и дети     12
1          1    Тургенев                 Рудин     10
4          2       Чехов       Дама с собачкой      7

### Задание_4

In [14]:
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети     12
1          1    Тургенев                 Рудин     10
2          1    Тургенев     Дворянское гнездо     43
3          2       Чехов      Толстый и тонкий     67
4          2       Чехов       Дама с собачкой      7
5          3  Островский                 Гроза     45
6          3  Островский  Таланты и поклонники     34

In [24]:
authors_stat = pd.DataFrame({'min_price' : author_price.groupby('author_name', sort=False)['price'].min(),
                             'max_price' : author_price.groupby('author_name', sort=False)['price'].max(),
                             'mean_price' : author_price.groupby('author_name', sort=False)['price'].mean()})
authors_stat

             min_price  max_price  mean_price
author_name
Тургенев            10         43   21.666667
Чехов                7         67   37.000000
Островский          34         45   39.500000

### Задание_5

In [26]:
author_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
author_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети     12  твердая
1          1    Тургенев                 Рудин     10   мягкая
2          1    Тургенев     Дворянское гнездо     43   мягкая
3          2       Чехов      Толстый и тонкий     67  твердая
4          2       Чехов       Дама с собачкой      7  твердая
5          3  Островский                 Гроза     45   мягкая
6          3  Островский  Таланты и поклонники     34   мягкая

In [33]:
book_info = pd.pivot_table(author_price,
                           values = 'price',
                           index = 'author_name',
                           columns = 'cover',
                           aggfunc = np.sum,
                           fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский       79        0
Тургенев         53       12
Чехов             0       74

In [34]:
book_info.to_pickle('book_info.pkl')
book_info

cover        мягкая  твердая
author_name
Островский       79        0
Тургенев         53       12
Чехов             0       74

In [35]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский       79        0
Тургенев         53       12
Чехов             0       74